In [3]:
import pandas as pd

In [11]:
data = {
'Student': ['Alice', 'Bob', 'Charlie', 'Alice', 'Bob', 'Charlie', 'Alice', 'Bob', 'Charlie'],
'Subject': ['Math', 'Math', 'Math', 'Science', 'Science', 'Science', 'English', 'English', 'English'],
'Score': [85, 90, 95, 80, 70, 75, 88, 92, 85]
}
df = pd.DataFrame(data)
df

   Student  Subject  Score
0    Alice     Math     85
1      Bob     Math     90
2  Charlie     Math     95
3    Alice  Science     80
4      Bob  Science     70
5  Charlie  Science     75
6    Alice  English     88
7      Bob  English     92
8  Charlie  English     85

In [6]:
media_per_materia = df.groupby('Subject')['Score'].mean()
media_per_materia

Subject
English    88.333333
Math       90.000000
Science    75.000000
Name: Score, dtype: float64

In [8]:
media_per_studente = df.groupby('Student')['Score'].mean()
media_per_studente

Student
Alice      84.333333
Bob        84.000000
Charlie    85.000000
Name: Score, dtype: float64

In [9]:
media_studente_materia = df.groupby(['Student', 'Subject'])['Score'].mean()
media_studente_materia

Student  Subject
Alice    English    88.0
         Math       85.0
         Science    80.0
Bob      English    92.0
         Math       90.0
         Science    70.0
Charlie  English    85.0
         Math       95.0
         Science    75.0
Name: Score, dtype: float64

In [17]:
df['Test Date'] = '2024-11-18'
df

   Student  Subject  Score   Test Date
0    Alice     Math     85  2024-11-18
1      Bob     Math     90  2024-11-18
2  Charlie     Math     95  2024-11-18
3    Alice  Science     80  2024-11-18
4      Bob  Science     70  2024-11-18
5  Charlie  Science     75  2024-11-18
6    Alice  English     88  2024-11-18
7      Bob  English     92  2024-11-18
8  Charlie  English     85  2024-11-18
9    Diana     Math     88  2024-11-18